[
  {
    "name": "The Webmaster",
    "url": "http://www.demonicskull.com",
    "message": "First post! Welcome to the DemonicSkull.com guestbook! Please sign it and let me know what you think. This site is a labor of love and I hope you all enjoy it. More content coming soon! Long live Monkey Island! Long live Murray!",
    "favorite": "ALL OF THEM!",
    "date": "12/22/1998 - 10:30 PM"
  },
  {
    "name": "MurrayTheSkull",
    "url": "",
    "message": "BWAHAHAHAHA! A website dedicated to ME, the all-powerful demonic skull?! EXCELLENT! At last, the mortals recognize my true power! Now if someone could just help me sign this guestbook... I seem to be lacking in the \"hands\" department.",
    "favorite": "The Curse of Monkey Island (obviously)",
    "date": "12/24/1998 - 08:00 AM"
  },
  {
    "name": "StanTheSalesman",
    "url": "",
    "message": "Have I got a deal for YOU! This site is PREVIOUSLY OWNED but in MINT CONDITION! Act NOW and I'll throw in a free bookmark! But seriously, great site. Stan approves! Previously-owned approval, but approval nonetheless! *waves arms wildly*",
    "favorite": "The Secret of Monkey Island",
    "date": "12/27/1998 - 04:20 PM"
  },
  {
    "name": "VoodooLady",
    "url": "",
    "message": "I sense... a great disturbance in the web. A new fan site has been born, and it is... GOOD. Seriously though, nice work! The layout is clean and loads fast on my 56k modem. Bookmarked!",
    "favorite": "The Secret of Monkey Island",
    "date": "12/29/1998 - 11:55 PM"
  },
  {
    "name": "GrogDrinker",
    "url": "",
    "message": "YOU FIGHT LIKE A DAIRY FARMER!! Haha just kidding. Cool site man. The Murray quotes are hilarious, I forgot about half of these. Makes me want to replay Curse again for the 5th time. Does anyone know when the next MI game is coming out???",
    "favorite": "The Curse of Monkey Island",
    "date": "01/03/1999 - 02:44 PM"
  },
  {
    "name": "ThreepwoodJr",
    "url": "",
    "message": "This site is better than a fine leather jacket! (get it?? LOL) Seriously though, great content. The games page has all the info I was looking for. One thing - could you add a section about the MI2 ending? I STILL don't understand it!!",
    "favorite": "Monkey Island 2: LeChuck's Revenge",
    "date": "01/05/1999 - 09:12 PM"
  },
  {
    "name": "LeChucksDad",
    "url": "http://www.lechuckslair.com",
    "message": "Found your site through the Monkey Island Webring. Really cool! I run LeChuck's Lair (see links page) and would love to do a link exchange. Email me! Also, nice choice going with the dark color scheme - very fitting for a Murray site.",
    "favorite": "Monkey Island 2: LeChuck's Revenge",
    "date": "01/08/1999 - 06:30 PM"
  },
  {
    "name": "ElaineFan",
    "url": "",
    "message": "Great site!! Love the insult sword fighting guide - I've been stuck on the Sword Master for WEEKS and your guide helped me beat her! THANK YOU!! More Elaine content please! :)",
    "favorite": "The Secret of Monkey Island",
    "date": "01/10/1999 - 03:17 PM"
  },
  {
    "name": "SkullKing2000",
    "url": "",
    "message": "Murray is the BEST character in any game EVER. Period. No arguments. This site does him justice. I especially like the animated Murray GIF in the header - very cool! Would love to see some MIDI files of the game music!",
    "favorite": "The Curse of Monkey Island",
    "date": "01/12/1999 - 08:45 PM"
  },
  {
    "name": "PirateFan_99",
    "url": "http://www.geocities.com/piratefan99",
    "message": "AWESOME site!!! The Murray shrine is the best thing on the internet! I've been looking for a good MI site for months and this is IT. Keep up the great work! Can you add a wallpaper section?",
    "favorite": "The Curse of Monkey Island",
    "date": "01/14/1999 - 11:23 PM"
  }
]